Autodesk.Revit.DB.Architecture.TopographyLink.GetInvalidSiteSurfaces
Return the invalid SiteSurfaces name.
Remarks:
The invalid SiteSurface failed to be created would due to many reasons. Such as collinear point for the facets.
Since:
2019

Autodesk.Revit.DB.Architecture.TopographyLink.GetMemberIds
Gets members of the topography link.
Returns:
A collection of Ids of the topography link memebers.
Since:
2019

Autodesk.Revit.DB.Architecture.TopographyLink.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a topography link element within the project.
document:
The document in which the new instance should be created.
topographyLinkTypeId:
The element id of the TopographyLink type.
Returns:
The newly created topography link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create new SiteSurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019